src/test/resources/com/stripe/model/payout_expand_deleted_bank_account.json

{
  "amount": 100,
  "arrival_date": 1507507200,
  "balance_transaction": "txn_1BAPKEDtHb1AhhMrkwNPRD47",
  "created": 1507409710,
  "currency": "usd",
  "description": null,
  "destination": {
    "currency": "usd",
    "deleted": true,
    "id": "ba_18cB2uDtHb1AhhMrd08CoS4U"
  },
  "failure_balance_transaction": null,
  "failure_code": null,
  "failure_message": null,
  "id": "po_1BAPKEDtHb1AhhMraoSwrT29",
  "livemode": false,
  "metadata": {},
  "method": "standard",
  "object": "payout",
  "source_type": "card",
  "statement_descriptor": null,
  "status": "paid",
  "type": "bank_account"
}
